# -*- coding: utf-8 -*-
from __future__ import unicode_literals
import sys,os
reload(sys)
sys.setdefaultencoding('utf-8')


categoryList = ['政治人物','中国人民解放军人物','皇帝','诗人','书法家','国家元首','各时代军事人物','科学家','内地明星','港台明星','博士生导师','诸子百家']

categoryDict = {'政治人物':'politician','中国人民解放军人物':'GeneralofPLA','皇帝':'emperor','诗人':'poet','书法家':'calligrapher','国家元首':'head_of_the_state','各时代军事人物':'ancient_general','科学家':'scientist','内地明星':'mainland_star','港台明星':'hktw_star','博士生导师':'professor','诸子百家':'ancient_thinker'}

infoKeyMapList = [('姓名' , 'name'),('别名(别号)' , 'nickname'),('英文名' , 'English'),('性别' , 'gender'),('所处朝代' , 'dynasty'),('籍贯' , 'origin'),('居住地' , 'residence'),('户籍地' , 'household'),('出生年月日' , 'birthdate'),('国籍' , 'nationality'),('民族' , 'people'),('婚姻状态' , 'marriage'),('政治面貌' , 'politics'),('宗教信仰' , 'religion'),('血型' , 'blood'),('身高' , 'height'),('体重' , 'weight'),('毕业院校' , 'school'),('学历' , 'education'),('学位' , 'degree'),('专业' , 'major'),('配偶' , 'spouse'),('儿女' , 'children'),('职业类别' , 'occupation'),('职务' , 'job')]

dataBaseKey = ['name','birthdate']

'''
户籍地
婚姻状态
学历
学位
专业
配偶
儿女
职业类别
'''
realKeyMapList = [('中文名','姓名'),('姓名','姓名'),('别名','别名(别号)'),('英文名' , '英文名'),('性别' , '性别'),('所处时代','所处朝代' ),('活跃年代','所处朝代' ),('籍贯' , '籍贯'),('祖籍' , '籍贯'),('出生地' , '籍贯'),('现居地','居住地'),('出生年月','出生年月日'),('国籍' , '国籍'),('民族' , '民族'),('民族族群','民族'),('政党','政治面貌'),('信仰' , '宗教信仰'),('血型' , '血型'),('身高' , '身高'),('体重' , '体重'),('毕业院校' , '毕业院校'),('职业','职务')]

educationKeyWord = {'大学':['大学','学院','党校','师范'],'高中':['高级中学'],'初中':['中学'],'小学':['小学']}

relationKeyWord = {'配偶':['夫人','配偶','爱人','丈夫',],'儿女':['女儿','儿子']}

Surnames =['赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','秦','尤','许',
'何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻','柏','水','窦','章',
'云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','俞','任','袁','柳',
'酆','鲍','史','唐','费','廉','岑','薛','雷','贺','倪','汤','滕','殷','罗','毕','郝','邬','安','常',
'乐','于','时','傅','皮','卞','齐','康','伍','余','元','卜','顾','孟','平','黄','和','穆','萧','尹',
'姚','邵','湛','汪','祁','毛','禹','狄','米','贝','明','臧','计','伏','成','戴','谈','宋','茅','庞',
'熊','纪','舒','屈','项','祝','董','梁','杜','阮','蓝','闵','席','季','麻','强','贾','路','娄','危',
'江','童','颜','郭','梅','盛','林','刁','钟','徐','邱','骆','高','夏','蔡','田','樊','胡','凌','霍',
'虞','万','支','柯','昝','管','卢','莫','经','房','裘','缪','干','解','应','宗','丁','宣','贲','邓',
'郁','单','杭','洪','包','诸','左','石','崔','吉','钮','龚','程','嵇','邢','滑','裴','陆','荣','翁',
'荀','羊','於','惠','甄','麴','家','封','芮','羿','储','靳','汲','邴','糜','松','井','段','富','巫',
'乌','焦','巴','弓','牧','隗','山','谷','车','侯','宓','蓬','全','郗','班','仰','秋','仲','伊','宫',
'宁','仇','栾','暴','甘','钭','厉','戎','祖','武','符','刘','景','詹','束','龙','叶','幸','司','韶',
'郜','黎','蓟','薄','印','宿','白','怀','蒲','邰','从','鄂','索','咸','籍','赖','卓','蔺','屠','蒙',
'池','乔','阴','郁','胥','能','苍','双','闻','莘','党','翟','谭','贡','劳','逄','姬','申','扶','堵',
'冉','宰','郦','雍','舄','璩','桑','桂','濮','牛','寿','通','边','扈','燕','冀','郏','浦','尚','农',
'温','别','庄','晏','柴','瞿','阎','充','慕','连','茹','习','宦','艾','鱼','容','向','古','易','慎',
'戈','廖','庾','终','暨','居','衡','步','都','耿','满','弘','匡','国','文','寇','广','禄','阙','东',
'殴','殳','沃','利','蔚','越','夔','隆','师','巩','厍','聂','晁','勾','敖','融','冷','訾','辛','阚',
'那','简','饶','空','曾','毋','沙','乜','养','鞠','须','丰','巢','关','蒯','相','查','後','荆','红',
'游','竺','权','逯','盖','益','桓','公','万俟','司马','上官','欧阳','夏侯','诸葛',
'闻人','东方','赫连','皇甫','尉迟','公羊','澹台','公冶','宗政','濮阳',
'淳于','单于','太叔','申屠','公孙','仲孙','轩辕','令狐','钟离','宇文',
'长孙','慕容','鲜于','闾丘','司徒','司空','亓官','司寇','仉','督','子车',
'颛孙','端木','巫马','公西','漆雕','乐正','壤驷','公良','拓跋','夹谷',
'宰父','谷梁','晋','楚','闫','法','汝','鄢','涂','钦','段干','百里','东郭','南门',
'呼延','归','海','羊舌','微生','岳','帅','缑','亢','况','后','有','琴','梁丘','左丘',
'东门','西门','商','牟','佘','佴','伯','赏','南宫','墨','哈','谯','笪','年','爱','阳','佟',
'第五','言','福']

dynastyMap = {
'三皇五帝':[-5000,-2145],
'夏朝':[-2145,-1675],
'商朝':[-1675,-1029],
'西周':[-1029,-771],
'东周':[-771,-476],
'战国':[-475,-221],
'秦朝':[-221,207],
'西汉':[-207,8],
'新朝':[8,23],
'东汉':[23,220],
'三国':[225,265],
'西晋':[265,316],
'东晋':[316,420],
'南北朝':[420,589],
'隋朝':[589,618],
'唐朝':[618,907],
'五代十国':[907,960],
'北宋':[960,1127],
'南宋':[1127,1279],
'元朝':[1279,1368],
'明朝':[1368,1644],
'清朝':[1644,1911],
'中华民国':[1911,1949],
'现代':[1949,5000],
}